Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: heuristics-of-utxo-heuristic-1/*.po
Languages: fr_fr

source: Bitcoin Privacy Series
fr_fr: Série "Confidentialité Bitcoin"

source: Heuristics of UTXO deanonymization
fr_fr: Heuristique de la déanonymisation UTXO

source: Heuristic 1: “All inputs of a transaction belong to the same wallet.”
fr_fr: Heuristique 1: "Toutes les entrées d'une transaction appartiennent au même wallet."

source: Most of the times, joining multiple inputs is a way to make a payment that is larger than any of the inputs alone.
fr_fr: Dans la plupart des cas, relier plusieurs entrées est une façon de faire un paiement qui est plus grand que les entrées seules.

source: Amount to pay
fr_fr: Quantité à payer

source: UTXOs you’ll use
fr_fr: Les UTXO que vous allez utiliser

source: So you have a good chance to be right by saying that all those inputs used in the same transaction belonged to the same wallet (and probably the same person).
fr_fr: Donc vous avez sûrement raison en disant que toutes ces entrées utilisées dans la même transaction appartenaient au même wallet (et donc à la même personne).

source: UTXOs in Bob’s wallet
fr_fr: UTXO dans le wallet de Bob

source: Which implies that the transactions that previously generated those UTXOs were all made to pay the same person/wallet.
fr_fr: Cela implique que les transaction qui ont généré ces UTXO ont toutes été faites pour payer la même personne/le même wallet.

source: Tx to Bob
fr_fr: Tx vers Bob

source: New UTXO
fr_fr: Nouveau UTXO

source: From the eavesdropper point of view:
fr_fr: Du point de vue de l'espion:

source: Bob makes a 2.5 BTC payment.
fr_fr: Bob effectue un paiement de 2.5 BTC.

source: Assuming the inputs used were from the same wallet
fr_fr: En partant du principe que les entrées utilisées viennent du même wallet

source: We can look at the txs that generated those UTXO
fr_fr: On peut regarder les tx qui ont généré ces UTXO

source: And conclude they were both payments to Bob.
fr_fr: Et en conclure que ce sont tous deux des paiements vers Bob.

source: So if one of the addresses that paid him is a known website for freelance programmers, we now know that Bob worked as a freelancer for them.
fr_fr: Donc si une des deux adresses qui l'ont payé est un site connu pour des programmeurs freelance, nous savons maintenant que Bob a travaillé en tant que freelancer pour eux.

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie

source: Main sources: https://www.youtube.com/watch?v=HScK4pkDNds
fr_fr: Source principale: https://www.youtube.com/watch?v=HScK4pkDNds
