Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-3/*.po
Languages: fr_fr

source: Understanding the Lightning Network - Part 3:
fr_fr: Comprendre le Lightning Network - Partie 3:

source: Going Off-chain
fr_fr: Aller off-chain

source: Last time, we used HTLC (Hash Time-Locked Contracts) so Alice could pay 1 btc to Carol using the already open channel between Alice and Bob. This effectively turned our bidirectional channel into a network.
fr_fr: La dernière fois, nous avons utilisé le HTLC (Hash Time-Locked Contracts) pour qu'Alice puisse payer 1 btc à Carol en utilisant le canal déjà ouvert d'Alice et Bob. Notre canal bidirectionnel est devenu un réseau.

source: Now, we are going to see how the HTLC transaction will be included in the channel balance so that we don’t need to update it immediately on the blockchain.
fr_fr: Maintenant, nous allons voir comment la transaction HTLC sera incluse dans la solde du canal pour qu'on ait pas besoin de la mettre à jour immédiatement sur la blockchain.

source: On their last commitment transactions before the HTLC, Alice and Bob had decided on the following balance:
fr_fr: Sur leurs dernières transactions d'engagement avant le HTLC, Alice et Bob ont choisi la solde suivante:

source: Three bitcoins for Bob
fr_fr: Trois bitcoins pour Bob

source: Five bitcoins for Alice
fr_fr: Cinq bitcoins pour Alice

source: To include the HTLC, they will follow almost the same procedure as before.
fr_fr: Pour inclure le HTLC, ils vont presque suivre la même procédure qu'auparavant.

source: Create new secret, exchange the hash and create new commitment transactions with the following structure:
fr_fr: Créer un nouveau secret, échanger le hash et créer des nouvelles transactions d'engagement avec la structure suivante:

source: Alice’s commitment
fr_fr: L'engagement d'Alice

# ./understanding-the-lightning-network-part-3/source-text.txt:24
source: 4 bitcoins to herself.
fr_fr: 4 bitcoins à elle-même.

# ./understanding-the-lightning-network-part-3/source-text.txt:28
source: to Alice’s key
fr_fr: vers la clé d'Alice

source: 3 bitcoins to a multisig address that can be unlocked by:
fr_fr: 3 bitcoins vers une adresse multisig qui peut être débloquée par:

# ./understanding-the-lightning-network-part-3/source-text.txt:34
source: Bob, after 1000 blocks.
fr_fr: Bob, après 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:36
source: Alice, if she presents Bob’s secret.
fr_fr: Alice, si elle présente le secret de Bob.

source: All businness as usual until now. But then...
fr_fr: Tout va bien pour l'instant. Mais ensuite...

# ./understanding-the-lightning-network-part-3/source-text.txt:40
source: 1 bitcoin to a multisig address that can be unlocked by:
fr_fr: 1 bitcoin vers une adresse multisig qui peut être débloquée par:

source: Bob, if he presents Carol’s secret and waits 1000 blocks.
fr_fr: Bob, si il présente le secret de Carol et attend 1000 blocs.

source: Security measure to give Alice time to “steal” the funds if Bob drops an old channel state and tries to rob her. In which case, she will unlock like this:
fr_fr: Mesure de sécurité qui donne à Alice du temps pour "voler" les fonds si Bob lâche un vieil état de canal et essaie de l'escroquer. Dans ce cas, elle va le déverrouiller comme ceci:

# ./understanding-the-lightning-network-part-3/source-text.txt:48
source: Alice, after 14 days.
fr_fr: Alice, après 14 jours.

source: Alice, if she presents Bob’s secret.
fr_fr: Alice, si elle présente le secret de Bob.

source: Bob’s commitment
fr_fr: L'engagement de Bob

source: 3 bitcoins to himself.
fr_fr: 3 bitcoins à lui-même.

# ./understanding-the-lightning-network-part-3/source-text.txt:58
source: to Bob’s key
fr_fr: vers la clé de Bob

# ./understanding-the-lightning-network-part-3/source-text.txt:60
source: 4 bitcoins to a multisig address that can be unlocked by:
fr_fr: 4 bitcoins vers l'adresse multisig qui peut être débloquée par:

# ./understanding-the-lightning-network-part-3/source-text.txt:64
source: Alice, after 1000 blocks.
fr_fr: Alice, après 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:66
source: Bob, if he presents Alice’s secret.
fr_fr: Bob, si il présente le secret d'Alice.

# ./understanding-the-lightning-network-part-3/source-text.txt:68
source: 1 bitcoin to a multisig address that can be unlocked by:
fr_fr: 1 bitcoin vers une adresse multisig qui peut être débloquée par:

source: Bob, if he presents Carol’s secret.
fr_fr: Bob, si il présente le secret de Carol.

# ./understanding-the-lightning-network-part-3/source-text.txt:74
source: Alice, after 14 days.
fr_fr: Alice, après 14 days.

source: Time for Alice to retrieve the bitcoin in case Bob doesn’t present the secret.
fr_fr: Du temps pour qu'Alice récupère le bitcoin si Bob ne présente pas le secret.

# ./understanding-the-lightning-network-part-3/source-text.txt:78
source: Bob, if he presents Alice’s secret.
fr_fr: Bob, s'il présente le secret d'Alice.

source: If Alice tries to rob him by droping an old channel state, he doesn’t need to have Carol’s secret to unlock the bitcoin.
fr_fr: Si Alice essaie de le voler en lâchant un vieil état de canal, il n'a pas besoin d'avoir le secret de Carol pour déverrouiller le bitcoin.

source: Again, each of them signs their half-valid transaction and gives it to the other.
fr_fr: Encore une fois, chacun d'entre eux signe sa transaction à moitié valide et la donne à l'autre.

source: Current state of things
fr_fr: L'état actuel des choses

source: So this is what will happen next if one of them drops this current channel state on the blockchain:
fr_fr: Donc c'est ce qui arrivera si l'un d'entre eux lâche l'état actuel du canal sur la blockchain:

source: Alice drops the channel:
fr_fr: Alice lâche le canal:

source: Bob gets 3 bitcoins immediately.
fr_fr: Bob reçoit 3 bitcoins immédiatement.

source: Alice gets 4 bitcoins in 1000 blocks.
fr_fr: Alice reçoit 4 bitcoins dans 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:98
source: Bob has 2 weeks to present Carol’s secret and retrieve the remaining bitcoin. If he doesn’t, Alice can take it back to herself.
fr_fr: Bob a 2 semaines pour présenter le secret de Carol et récupérer le bitcoin restant. S'il ne le fait pas, Alice peut le récupérer.

source: Bob drops the channel:
fr_fr: Bob laisse tomber le canal:

source: Alice gets 4 bitcoins immediately.
fr_fr: Alice récupère 4 bitcoins immédiatement.

source: Bob gets 3 bitcoins in 1000 blocks.
fr_fr: Bob récupère 3 bitcoins en 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:112
source: Bob has 2 weeks to present Carol’s secret and retrieve the remaining bitcoin. If he doesn’t, Alice can take it back to herself.
fr_fr: Bob a 2 semaines pour présenter le secret de Carol et récupérer le bitcoin restant. S'il ne le fait pas, Alice peut le récupérer.

source: And if any of them tries to broadcast this state when it’s already outdated, the other can “steal” all the bitcoins.
fr_fr: Et si l'un d'entre eux essaie de diffuser cet état alors qu'il est déjà dépassé, l'autre peut "voler" tous les bitcoins.

source: The updating agreement
fr_fr: L'accord de mise à jour

source: Both Alice and Bob know that Bob will have the HTLC bitcoin if he has Carol’s secret. So, in order to keep the channel open and simplify things, they can agree to update the balance with new commitment transactions as follows:
fr_fr: Alice et Bob savent tous deux que Bob aura le bitcoin HTLC si il a le secret de Carol. Donc, pour garder le canal ouvert et simplifier les choses, ils peuvent se mettre d'accord en mettant à jour la solde avec de nouvelles transactions d'engagement:

source: Alice’s new commitment
fr_fr: Le nouvel engagement d'Alice

# ./understanding-the-lightning-network-part-3/source-text.txt:124
source: 4 bitcoins to herself.
fr_fr: 4 bitcoins à elle-même.

# ./understanding-the-lightning-network-part-3/source-text.txt:128
source: to Alice’s key
fr_fr: vers la clé d'Alice

# ./understanding-the-lightning-network-part-3/source-text.txt:130
source: 4 bitcoins to a multisig address that can be unlocked by:
fr_fr: 4 bitcoins vers une adresse multisig qui peut être débloquée par:

# ./understanding-the-lightning-network-part-3/source-text.txt:134
source: Bob, after 1000 blocks.
fr_fr: Bob, après 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:136
source: Alice, if she presents Bob’s secret.
fr_fr: Alice, si elle présente le secret de Bob.

source: Bob’s new commitment
fr_fr: Le nouvel engagement de Bob

source: 4 bitcoins to himself.
fr_fr: 4 bitcoins envers lui-même.

# ./understanding-the-lightning-network-part-3/source-text.txt:144
source: to Bob’s key
fr_fr: vers la clé de Bob

# ./understanding-the-lightning-network-part-3/source-text.txt:146
source: 4 bitcoins to a multisig address that can be unlocked by:
fr_fr: 4 bitcoins vers une adresse multisig qui peut être débloquée par:

# ./understanding-the-lightning-network-part-3/source-text.txt:150
source: Alice, after 1000 blocks.
fr_fr: Alice, après 1000 blocs.

# ./understanding-the-lightning-network-part-3/source-text.txt:152
source: Bob, if he presents Alice’s secret.
fr_fr: Bob, s'il présente le secret d'Alice.

source: Closing the channel
fr_fr: Fermer le canal

source: To finally close the channel, Alice and Bob will create and broadcast a transaction directly from the opening transaction with the final balance, i.e., the most recent channel state.
fr_fr: Pour clore le canal, Alice et Bob doivent créer et diffuser une transaction venant directement d'une transaction d'ouverture avec la solde finale, c'est à dire l'état de canal le plus récent.

source: 4 bitcoins to Bob.
fr_fr: 4 bitcoins vers Bob.

source: 4 bitcoins to Alice.
fr_fr: 4 bitcoins vers Alice.

source: This means that only 2 transactions actually got to be written on the blockchain: the opening and the closing transaction.
fr_fr: Cela veut dire que seules 2 transactions peuvent être écrites sur la blockchain: celle d'ouverture et de fermeture.

source: Off-chain transactions
fr_fr: Transactions off-chain

source: Opening transaction
fr_fr: Transaction d'ouverture

source: Closing transaction
fr_fr: Transaction de fermeture

source: It works the same no matter how many times they transacted with the channel open.
fr_fr: Cela fonctionne de la même façon quel que soit le nombre de fois où ils ont échangé avec le canal ouvert.

source: That’s why the lightning network is such a huge step to reduce the overload of transactions on the blockchain; and, therefore, improve Bitcoin’s scalability.
fr_fr: C'est pour ça que le Lightning network est une étape énorme pour réduire la surcharge de transactions sur la blockchain; et, du coup, améliorer la scalabilité du Bitcoin.

source: POWERED BY
fr_fr: ALIMENTE PAR

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-completing-the-puzzle-and-closing-the-channel-1466178980/
fr_fr: Sources principales: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-completing-the-puzzle-and-closing-the-channel-1466178980/
