Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: what-*-pow/*.po
Languages: fr_fr

source: THE BITCOIN MINING SAGA - PART II
fr_fr: LA SAGA DU MINING DE BITCOIN - PARTIE II

source: What is Proof of Work (PoW)?
fr_fr: Qu'est-ce que le Proof of Work (PoW) ?

source: It’s a method to ensure that the information (the new block) was difficult (costly, time-consuming) to be made.
fr_fr: C'est une méthode qui assure que l'information (le nouveau bloc) était difficile (coûteux, chronophage) à créer.

source: It costs processing power.
fr_fr: Cela coûte de la puissance de traitement.

source: Which can be translated to: hardware, energy and time.
fr_fr: Qui peut se traduire par: hardware, énergie et temps.

source: It’s easy, on the other hand, for others to check if the requirements were met.
fr_fr: C'est facile, par contre, pour les autres de vérifier si les exigences sont rencontrées.

source: In Practice
fr_fr: En Pratique

source: (made simple)
fr_fr: (version simple)

source: BEGIN HERE
fr_fr: COMMENCER ICI

source: Miner proposes new block
fr_fr: Un mineur propose un nouveau bloc

source: Header of the most recent block
fr_fr: Header du bloc le plus récent

source: NONCE (an incremental number)
fr_fr: NONCE (un nombre incrémentiel)

source: Combines and hashes
fr_fr: Combine et "hash"

source: HASH number
fr_fr: Nombre HASH

source: Mining Difficulty
fr_fr: Difficulté de Minage

source: Determines
fr_fr: Détermine

source: Target Value
fr_fr: La Valeur Cible

source: Compares
fr_fr: Compare

source: Is HASH < Target Value?
fr_fr: Le HASH est-il < à la Valeur Cible ?

source: Increments and try again
fr_fr: Incrémente et réessaye

source: YES
fr_fr: OUI

source: You solved the PoW!
fr_fr: Vous avez résolu le PoW !

source: Mining Reward
fr_fr: Récompense de Minage

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie
