Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: why-build-the-lightning-network/*.po
Languages: fr

source: Why build the Lightning Network?
fr: Pourquoi construire le Lightning Network ?

source: What is the big idea?
fr: Quelle est la grande idée ?

source: The lightning network is a scaling approach to Bitcoin.
fr: Le Lightning Network est une approche de scalabilité du Bitcoin.

source: It’s really about moving a lot of Bitcoin transactions out of the blockchain and into private channels between users, but still counting on the blockchain’s security.
fr: Cela repose sur le fait de bouger de nombreuses transactions Bitcoin hors de la blockchain vers des canaux privés entre utilisateurs, tout en comptant sur la sécurité de la blockchain.

source: Off-chain transactions
fr: Transactions hors-blockchain

source: It’s like a contract and arbitration system (with a poetic license, of course):
fr: C'est comme un contrat, un système d'arbitrage (avec une licence poétique bien sûr):

source: Imagine you want to make a deal with someone and, for that, you create a contract and register it with a notary.
fr: Imaginez vouloir faire un marché avec quelqu'un et, pour ça, créer un contrat et l'enregistrer auprès d'un notaire.

source: That’s you opening a lightning network channel with someone.
fr: Ça, c'est vous ouvrant un canal du Lightning network avec quelqu'un.

source: You expect to do this deal without any hassles, with both parties fulfilling their duties. But, anyway, you have a contract to protect yourself.
fr: Vous espérez conclure ce marché sans difficulté, avec chaque deux parties respectant ses devoirs. Mais, dans tous les cas, vous avez un contrat pour vous protéger.

source: You create commitment transactions that are not really broadcast, unless necessary to resolve a dispute.
fr: Vous créez des transactions d'engagement qui ne sont pas vraiment diffusées, à moins d'être nécessaires à la résolution d'une dispute.

source: If one of you breaks the agreement, you can take this contract to a court that will recognize it as valid and give gain to the honest party.
fr: Si un d'entre vous brise cet accord, vous pouvez utiliser ce contrat dans un tribunal qui le reconnaîtra comme valide, et qui donnera raison à la partie honnête.

source: If someone tries to rob you (broadcasting an old channel state), you can take the contract to the blockchain and get all the bitcoins in the channel. Only, in this case, there’s no subjectivity in interpreting the contract.
fr: Si quelqu'un essaie de vous voler (en diffusant un vieil état du canal), vous pouvez emmener le contrat sur la blockchain et avoir tous les bitcoins du canal. Dans ce cas, il n'y a aucune subjectivité dans l'interprétation du contrat.

source: In practice, most people don’t ever need to go to a court because nobody broke their contract, so the arbitration system doesn’t get bloated.
fr: En pratique, la plupart des gens n'ont pas besoin d'aller au tribunal parce que personne n'a brisé leur contrat, donc le système d'arbitrage ne gonfle pas.

source: OPEN
fr: OUVERT

source: Countless transactions can occur in private and off-chain while a channel is open and both parties are being honest, therefore, unburdening the blockchain.
fr: De nombreuses transactions peuvent être faites en privé et hors-chain quand un canal est ouvert et que les deux parties sont honnêtes, déchargeant la blockchain.

source: If using the lightning network, only 3 types of transactions need to be broadcast to the blockchain:
fr: En utilisant le Lightning network, seuls 3 types de transactions doivent être diffusées sur la blockchain:

source: The transaction that opens a channel.
fr: La transaction qui ouvre un canal.

source: The transaction that closes a channel.
fr: La transaction qui ferme le canal.

source: Disputes that need to be settled.
fr: Les disputes qui doivent être réglées.

source: The big features
fr: Les fonctionnalités importantes

source: Fast and cheap
fr: Rapide et peu cher

source: Now you can actually get instant and almost free payments since you can mainly transact without the limitations of writing on the blockchain. Which means micro-payments are now totally viable!
fr: Maintenant, vous pouvez effectuer des paiements instantanés et quasi-gratuits car vous pouvez échanger sans les limitations de l'écriture sur la blockchain. Les micro-paiements sont désormais viables !

source: Practical
fr: Pratique

source: You only have to open a few channels to be able to transact with the whole network because channels are interconnected.
fr: Vous n'avez besoin que d'ouvrir quelques canaux pour effectuer les transactions avec tout le réseau, parce que les canaux sont interconnectés.

source: No expiration date
fr: Pas de date d'expiration

source: Channels can stay open indefinitely, maximizing the unburdening effect on the blockchain and dissolving the fees for the opening and closing transactions of a channel.
fr: Les canaux peuvent rester ouverts indéfiniment, maximisant leur effet de décharge sur la blockchain et diluant les frais pour les transactions d'ouverture et de fermeture d'un canal.

source: OPEN 24/7
fr: OUVERT 24/7

source: Improved privacy
fr: Une discrétion améliorée

source: It can use encryption and intermediary nodes that relay transactions without knowing its origin and destiny (onion-style routing).
fr: Il peut utiliser l'encodage et les nœuds intermédiaires qui relaient les transactions sans connaître leur origine et destination (semblable au routage onion).

source: Author: Patrícia Estevão
fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr: Editeur: Marco Agner

source: The court analogy was described in reddit a while ago, I just couldn’t find a link to it. If someone finds it, please send it to me. :)
fr: L'analogie du tribunal était décrite en détail sur reddit il y a quelque temps, je n'ai pas pu en trouver le lien. Si quelqu'un le trouve, envoyez-le moi s'il vous plaît. :)
