Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-1/*.po
Languages: fr_fr

source: Understanding the Lightning Network - Part 1:
fr_fr: Comprendre le Lightning Network - Partie 1:

source: Payment Channels
fr_fr: Canaux de Paiement

source: Payment channels are one of the main elements playing a role in the Lightning network, so let’s take a look at how they works.
fr_fr: Les canaux de paiement sont un des éléments principaux jouant un rôle dans le Lightning Network, voyons comment ils fonctionnent.

source: What is a payment channel?
fr_fr: Qu'est-ce qu'un canal de paiement ?

source: It’s a manner to make a series of transactions “off-chain”, i.e. without actually relaying them to the blockchain, but still benefitting from the “on-chain” security.
fr_fr: C'est une manière de créer une série de transactions "off-chain", c-à-d. sans vraiment les relayer sur la blockchain, mais tout en gardant la sécurité "on-chain".

source: That allows a huge number of really fast and almost free transactions to be made through the channel, because you don’t need to settle each of them on the blockchain.
fr_fr: Cela permet à de nombreuses de transactions rapides et quasi-gratuites d'être faites au travers du canal, parce que vous n'avez pas besoin de les établir sur la blockchain.

source: For the Lightning Network, we need bidirectional payment channels, which means that both parties that start a channel have to be able to send bitcoins.
fr_fr: Pour le Lightning Network, nous avons besoin de canaux de paiement bidirectionnels, où les deux parties qui créent un canal doivent pouvoir envoyer des bitcoins.

source: And, of course, this channel has to work trustlessly, so the parties don’t need to trust each other to agree with beginning transacting.
fr_fr: Et, bien sûr, ce canal doit fonctionner sans système de confiance, pour que les parties n'aient pas besoin de se faire confiance pour commencer les transactions.

source: Opening a channel
fr_fr: Ouvrir un canal

source: Alice needs to send 1 btc to Bob. Since they know they are going to do a lot of transactions in the near future, they decide to use a lightning network channel to make things faster and cheaper. They will start a channel with a 4 bitcoins deposit by creating an opening transaction.
fr_fr: Alice doit envoyer 1 btc à Bob. Comme ils savent qu'ils vont faire beaucoup de transactions dans le futur proche, ils décident d'utiliser un canal du Lightning network pour être plus rapide et moins cher. Ils vont créer un canal avec un dépôt de 4 bitcoins en créant une transaction d'ouverture.

# ./understanding-the-lightning-network-part-1/source-text.txt:24
source: Step-by-step
fr_fr: Etape par étape

source: Each of them sends 4 bitcoins to a multisig address that needs both their keys to sign a valid spending transaction.
fr_fr: Chacun d'entre eux doit envoyer 4 bitcoins sur une adresse multisig qui a besoin de leurs clés pour signer une transaction valide.

# ./understanding-the-lightning-network-part-1/source-text.txt:28
source: Opening transaction
fr_fr: Transaction d'ouverture

source: from Bob
fr_fr: de Bob

source: from Alice
fr_fr: d'Alice

source: They create a secret (string of numbers) and a hash of the secret, and exchange the hash with the other.
fr_fr: Ils créent un secret (chaîne de nombres) et un hash du secret, et échangent le hash avec l'autre.

source: Bob’s secret hash
fr_fr: Le hash secret de Bob

source: Alice’s secret hash
fr_fr: Le hash secret d'Alice

source: Remember, the first transaction we want to make is the 1 bitcoin that Alice has to give Bob.
fr_fr: N'oubliez pas que la première transaction que nous voulons faire est le bitcoin qu'Alice veut envoyer à Bob.

source: Alice creates a commitment transaction from the opening transaction sending 3 bitcoins to herself and 5 to a new multisig address.
fr_fr: Alice créé une transaction d'engagement depuis la transaction d'ouverture en envoyant 3 bitcoins à elle-même et 5 à une nouvelle adresse multisig.

source: Alice’s first commitment transaction
fr_fr: La première transaction d'engagement d'Alice

# ./understanding-the-lightning-network-part-1/source-text.txt:52
source: 1st condition
fr_fr: 1re condition

# ./understanding-the-lightning-network-part-1/source-text.txt:58
source: 2nd condition
fr_fr: 2nde condition

# ./understanding-the-lightning-network-part-1/source-text.txt:64
source: This new multisig address can be unlocked by:
fr_fr: Cette nouvelle adresse multisig peut être débloquée par:

source: Bob, only after 1000 extra blocks are mined (this condition has a time lock called CheckSequenceVerify).
fr_fr: Bob, seulement après que 1000 blocs de plus soient minés (cette condition a un verrouillage temporel appelé CheckSequenceVerify).

source: Alice, if she presents the secret for which Bob gave her the hash previously (having only the hash will not work so, for now, she can’t unlock the transaction).
fr_fr: Alice, si elle présente le secret pour lequel Bob lui a donné le hash (seulement avoir le hash ne suffira pas donc, pour l'instant, elle ne peut débloquer la transaction).

# ./understanding-the-lightning-network-part-1/source-text.txt:74
source: to Bob’s key + 1000 block wait
fr_fr: vers la clé de Bob + attente de 1000 blocs

# ./understanding-the-lightning-network-part-1/source-text.txt:76
source: OR
fr_fr: OU

# ./understanding-the-lightning-network-part-1/source-text.txt:78
source: to Alice’s key + Bob’s secret
fr_fr: vers la clé d'Alice + le secret de Bob

source: Alice signs the commitment transaction and gives the half-valid transaction (needs Bob signature to be valid) to Bob.
fr_fr: Alice signe la transaction d'engagement et donne la transaction à moitié valide (elle a besoin de sa signature) à Bob.

source: Bob also creates a half-valid transaction with his signature sending 5 btcs to himself and 3 to a new multisig address and gives it to Alice.
fr_fr: Bob doit aussi créer une transaction à moitié valide avec sa signature, s'envoyant 5 btcs et 3 à une nouvelle adresse multisig et la donne à Alice.

source: Bob’s first commitment transaction
fr_fr: La première transaction d'engagement

# ./understanding-the-lightning-network-part-1/source-text.txt:86
source: 1st condition
fr_fr: 1re condition

# ./understanding-the-lightning-network-part-1/source-text.txt:92
source: 2nd condition
fr_fr: 2nde condition

# ./understanding-the-lightning-network-part-1/source-text.txt:98
source: This new multisig address can be unlocked by:
fr_fr: Cette nouvelle adresse multisig peut être débloquée par:

source: Alice, after waiting 1000 new blocks being mined.
fr_fr: Alice, après avoir attendu que 1000 nouveaux blocs soient minés.

source: Bob, if presenting Alice’s secret.
fr_fr: Bob, si il a le secret d'Alice.

# ./understanding-the-lightning-network-part-1/source-text.txt:108
source: to Alice’s key + 1000 block wait
fr_fr: vers la clé d'Alice + attente de 1000 blocs

# ./understanding-the-lightning-network-part-1/source-text.txt:110
source: OR
fr_fr: OU

# ./understanding-the-lightning-network-part-1/source-text.txt:112
source: to Bob’s key + Alice’s secret
fr_fr: vers la clé de Bob + le secret d'Alice

source: After the exchange of the half-valid transactions, the opening transaction is broadcast and recorded on the blockchain. The channel is officially open.
fr_fr: Après l'échange des transactions à moitié valides, la transaction d'ouverture est diffusée et enregistrée sur la blockchain. Le canal est officiellement ouvert.

# ./understanding-the-lightning-network-part-1/source-text.txt:116
source: Opening transaction
fr_fr: Transaction d'ouverture

source: Updating a channel
fr_fr: Mettre à jour un canal

source: Now, Bob has to give 2 bitcoins to Alice, so they need to update the channel state with new commitment transactions that will reflect the new balance.
fr_fr: Maintenant, Bob doit donner 2 bitcoins à Alice, donc ils doivent mettre à jour l'état du canal avec de nouvelle transactions d'engagement, qui refléteront la nouvelle solde.

# ./understanding-the-lightning-network-part-1/source-text.txt:122
source: Step-by-step
fr_fr: Etape par étape

source: New secrets are created and their hashes exchanged. They will be used for this next commitment transaction.
fr_fr: De nouveaux secrets sont créés et leurs hash échangés. Ils seront utilisés pour la prochaine transaction d'engagement.

source: Bob’s secret
fr_fr: Le secret de Bob

source: Alice’s secret
fr_fr: Le secret d'Alice

source: Alice creates a commitment transaction sending 5 btc to herself and 3 btc to a new multisig address that has the same unlocking conditions as before, signs and gives it to Bob.
fr_fr: Alice créé une transaction d'engagement, s'envoyant 5 btc et 3 btc à une nouvelle adresse multisig qui a les mêmes conditions de déblocage qu'avant, la signe et la donne à Bob.

source: Alice’s second commitment transaction
fr_fr: La seconde transaction d'engagement d'Alice

# ./understanding-the-lightning-network-part-1/source-text.txt:138
source: 1st condition
fr_fr: 1re condition

# ./understanding-the-lightning-network-part-1/source-text.txt:144
source: 2nd condition
fr_fr: 2nde condition

# ./understanding-the-lightning-network-part-1/source-text.txt:150
source: to Bob’s key + 1000 block wait
fr_fr: vers la clé de Bob + l'attente de 1000 blocs

# ./understanding-the-lightning-network-part-1/source-text.txt:152
source: OR
fr_fr: OU

# ./understanding-the-lightning-network-part-1/source-text.txt:154
source: to Alice’s key + Bob’s secret
fr_fr: vers la clé d'Alice + le secret de Bob

source: Bob creates a commitment transaction sending 3 btc to himself and 5 btc to the new multisig address with the same unlocking conditions as before, signs and gives it to Alice.
fr_fr: Bob créé une transaction d'engagement, s'envoyant 5 btc et 3 btc à une nouvelle adresse multisig qui a les mêmes conditions de déblocage qu'avant, la signe et la donne à Alice.

source: Bob’s second commitment transaction
fr_fr: La seconde transaction d'engagement de Bob

# ./understanding-the-lightning-network-part-1/source-text.txt:160
source: 1st condition
fr_fr: 1re condition

# ./understanding-the-lightning-network-part-1/source-text.txt:166
source: 2nd condition
fr_fr: 2nde condition

# ./understanding-the-lightning-network-part-1/source-text.txt:172
source: to Alice’s key + 1000 block wait
fr_fr: vers la clé d'Alice + l'attente de 1000 blocs

# ./understanding-the-lightning-network-part-1/source-text.txt:174
source: OR
fr_fr: OU

# ./understanding-the-lightning-network-part-1/source-text.txt:176
source: to Bob’s key + Alice’s secret
fr_fr: vers la clé de Bob + le secret d'Alice

source: Alice and Bob exchange their old secrets, used in the first commitment.
fr_fr: Alice et Bob échangent leurs vieux secrets, utilisés dans le premier engagement.

source: This process is repeated every time the balance needs to be updated.
fr_fr: Ce processus est répété à chaque fois que le solde doit être mis à jour.

source: Incentives for a trustless system
fr_fr: Motivations pour un système sans confiance

source: So now Bob has 2 commitment transactions, the first one giving him more money than the second. So why doesn’t he broadcast the first one now and scam Alice? Let’s see what would happen.
fr_fr: Donc maintenant Bob a 2 transactions d'engagement, la première lui donnant plus d'argent que la seconde. Pourquoi ne diffuserait-il pas la première maintenant, escroquant Alice ? Regardons ce qui se passerait.

# ./understanding-the-lightning-network-part-1/source-text.txt:186
source: Step-by-step
fr_fr: Etape par étape

source: Bob signs and broadcasts the half-valid transaction that Alice first sent him.
fr_fr: Bob signe et diffuse la transaction à moitié valide qu'Alice lui a d'abord envoyé.

source: Alice will get 3 btc (her balance at the time of the commitment) immediately.
fr_fr: Alice recevra 3 btc (sa solde au moment de l'engagement) immédiatement.

source: The other 5 btc will go to the address that Bob can only unlock after 1000 blocks.
fr_fr: Les 5 autres btc iront à l'adresse que Bob peut déverrouiller après 1000 blocks.

source: Bob’s key + 1000 block wait
fr_fr: La clé de Bob + attente de 1000 blocs

source: But now Alice has Bob’s secret from that commitment, so she can access the multisig address before Bob (she doesn’t have to wait 1000 blocks) and get all the bitcoins to herself.
fr_fr: Mais maintenant Alice a le secret de Bob venant de cet engagement, donc elle peut accéder l'adresse multisig avant Bob (elle n'a pas à attendre 1000 blocs) et prendre tous les bitcoins.

# ./understanding-the-lightning-network-part-1/source-text.txt:198
source: to Alice’s key + Bob’s secret
fr_fr: vers la clé d'Alice + le secret de Bob

source: Bob’s attempt to defraud Alice has just backfired!
fr_fr: La tentative de Bob pour escroquer Alice s'est retournée contre lui !

source: The same will happen if Alice is the one trying to broadcast an old commitment. This way, both parties are strongly incentivized to respect the most recent state of the channel.
fr_fr: La même chose arrivera si Alice essaie de diffuser un vieil engagement. De cette façon, les deux parties sont poussées à respecter l'état le plus récent du canal.

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/
fr_fr: Sources principales: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/
