Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-2/*.po
Languages: fr_fr

source: Understanding the Lightning Network - Part 2:
fr_fr: Comprendre le Lightning Network - Partie 2:

source: Shaping the network
fr_fr: Former le network

source: Adding a new party
fr_fr: Ajouter une nouvelle partie

source: Alice and Bob have already succeeded in creating a bidirectional payment channel. Now, Alice wants to pay 1 bitcoin to her friend Carol.
fr_fr: Alice et Bob ont déjà réussi à créer un canal de paiement bidirectionnel. Maintenant, Alice veut envoyer 1 bitcoin à son amie Carol.

source: Instead of creating a channel between Alice and Carol, Carol will be added to the payroll using the already established channel.
fr_fr: Au lieu de créer un canal entre Alice et Carol, Carol sera ajoutée à l'effectif en utilisant le canal déjà établi.

source: Here’s the general idea of how it will work:
fr_fr: Voici l'idée générale, comment cela va marcher:

# ./understanding-the-lightning-network-part-2/source-text.txt:16
source: Step-by-step
fr_fr: Etape par étape

source: Carol creates a secret and sends its hash to Alice.
fr_fr: Carol créé un secret et envoie son hash à Alice.

source: Carol’s secret hash
fr_fr: Le hash secret de Carol

source: sends to Alice
fr_fr: envoie à Alice

source: Carol gives her secret to Bob in exchange for a bitcoin.
fr_fr: Carol donne son secret à Bob en échange d'un bitcoin.

source: Alice asks Bob to show Carol’s secret and promisses a bitcoin in exchange.
fr_fr: Alice demande à Bob de lui montrer le secret de Carol et promet un bitcoin en échange.

source: Alice knows Bob must have gotten the secret from Carol, so she can be sure Carol got her bitcoin.
fr_fr: Alice sait que Bob a eu le secret de la part de Carol, pour qu'elle soit sûre que Carol ait eu son bitcoin.

source: Alice gives Bob one bitcoin.
fr_fr: Alice donne un bitcoin à Bob.

source: Fixing trust issues
fr_fr: Résoudre des problèmes de confiance

source: But what about Bob?
fr_fr: Et Bob dans tout ça ?

source: In this scenario, he can be tricked by Carol, if she receives his bitcoin and doesn’t give him the secret, or by Alice, if he shows Carol’s secret and she doesn’t give him a bitcoin.
fr_fr: Dans ce scénario, il peut être faussé par Carol, si elle reçoit son bitcoin et ne lui donne pas le secret, ou par Alice, si il montre le secret de Carol et ne lui envoie pas un bitcoin.

source: To solve that, we are going to rethink these last steps adding a time lock clause called Hash Time-Locked Contracts (HTLC) as protection for Bob.
fr_fr: Pour résoudre cela, nous allons repenser ces dernières étapes en ajoutant un verrouillage temporel appelé Hash Time-Locked Contracts (HTLC) comme protection pour Bob.

# ./understanding-the-lightning-network-part-2/source-text.txt:50
source: Step-by-step
fr_fr: Etape par étape

source: Alice sends 1 btc to a multisig address that can be unlocked by:
fr_fr: Alice envoie 1 btc à une adresse multisig qui peut être déverrouillée par:

source: Bob, if he presents Carol’s secret.
fr_fr: Bob, si il montre le secret de Carol.

source: Alice, but only after some time, let’s say 2 weeks.
fr_fr: Alice, mais seulement après un certain temps, disons 2 semaines.

source: Alice’s transaction with Bob
fr_fr: La transaction d'Alice avec Bob

source: to Bob’s key + Carol’s secret
fr_fr: vers la clé de Bob + le secret de Carol

# ./understanding-the-lightning-network-part-2/source-text.txt:66
source: OR
fr_fr: OU

source: to Alice’s key + 14 days
fr_fr: vers la clé d'Alice + 14 jours

source: This means Bob has 2 weeks to perform his deal with Carol and broadcast a transaction that claims this bitcoin. And, if he decides not to go on with his part, Alice can still get her bitcoin back.
fr_fr: Cela veut dire que Bob a 2 semaines pour faire son deal avec Carol et diffuser la transaction qui demandent ce bitcoin. S'il décide de ne pas remplir sa part, Alice peut récupérer son bitcoin.

source: Bob sends 1 btc to a multisig address that can be unlocked by:
fr_fr: Bob envoie 1 btc vers une adresse multisig qui peut être déverrouillée par:

source: Carol, if she presents her secret.
fr_fr: Carol, si elle montre son secret.

source: Bob, but only after some time, let’s say 10 days.
fr_fr: Bob, mais seulement après 10 jours.

source: Bob’s transaction with Carol
fr_fr: La transaction de Bob avec Carol

source: to Carol’s key + Carol’s secret
fr_fr: vers la clé de Carol + le secret de Carol

# ./understanding-the-lightning-network-part-2/source-text.txt:86
source: OR
fr_fr: OU

source: to Bob’s key + 10 days
fr_fr: vers la clé de Bob + 10 jours

source: It’s important for the time lock on this contract to end before the lock on Alice’s contract. Otherwise, Bob is in risk of paying Carol and not getting paid by Alice because she could reclaim her bitcoin.
fr_fr: C'est important pour le verrouillage temporel sur ce contrat de se terminer avant le verrouillage sur le contrat d'Alice. Autrement, Bob coure le risque de payer Carol et de ne pas être payé par Alice parce qu'elle pourrait récupérer son bitcoin.

source: Carol will present her secret to Bob’s contract, before the 10 days time lock ends, and receive the bitcoin.
fr_fr: Carol présentera son secret au contrat de Bob, avant que le verrouillage de 10 jours se termine, et recevra le bitcoin.

source: Bob will present Carol’s secret to Alice’s contract, before the end of 14 days, and receive the bitcoin.
fr_fr: Bob présentera le secret de Carol au contrat d'Alice, avant la fin des 14 jours, et recevra le bitcoin.

source: Alice will have blockchain proof that Carol received her bitcoin (the secret she presented in Bob’s contract).
fr_fr: Alice aura la preuve par la blockchain que Carol a reçu son bitcoin (le secret qu'elle a présenté dans le contrat de Bob).

source: The guarantees
fr_fr: Les garanties

source: The point of these HTLC contracts is to guarantee some important outcomes:
fr_fr: Le but de ces contrats HTLC est de garantir quelques finalités importantes:

source: If Carol presents her secret, stamping it publicly on the blockchain, she is guaranteed to get her bitcoin from Bob.
fr_fr: Si Carol présente son secret, le tamponnant publiquement sur la blockchain, elle est garantie d'avoir son bitcoin de Bob.

source: If Carol claims her bitcoin from Bob, Bob is guaranteed to have her secret.
fr_fr: Si Carol demande son bitcoin à Bob, Bob est garanti d'avoir son secret.

source: If Bob presents Carol’s secret, he’s guaranteed to get a bitcoin from Alice.
fr_fr: Si Bob présente le secret de Carol, il est garanti d'avoir un bitcoin d'Alice.

source: If Alice sees Carol’s secret on the blockchain, she’s guaranteed that Carol got the payment she was due.
fr_fr: Si Alice voit le secret de Carol sur la blockchain, elle a la garantie que Carol a reçu le paiement qui lui était dû.

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-creating-the-network-1465326903/
fr_fr: Sources principales: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-creating-the-network-1465326903/
