Repository: lxparallel/bitcoindesigned-infographics-i18n
Catalog: what-*-the-mining-difficulty/*.po
Languages: fr_fr

source: The bitcoin mining saga - Part III
fr_fr: La saga du minage de Bitcoin - Partie III

source: What is the Mining Difficulty?
fr_fr: Qu'est-ce que la difficulté de minage ?

source: It’s a mesure of how difficult is to find a hash below the target value (a 256-bit number) during the Proof of Work.
fr_fr: C'est une mesure de la difficulté pour trouver un hash en dessous de la valeur cible (un nombre 256-bit) pendant le Proof of Work.

source: Mining Difficulty
fr_fr: Difficulté de Minage

source: Target Value
fr_fr: Valeur Ciblée

source: How does it work?
fr_fr: Comment ça marche ?

source: More miners join the network
fr_fr: Plus de mineurs rejoignent le réseau

source: Block creation rate increases
fr_fr: La vitesse de création de blocs augmente

source: Average mining time decreases
fr_fr: Le temps de minage moyen baisse

source: Mining difficulty increases
fr_fr: La difficulté de minage augmente

source: Block creation rate goes down
fr_fr: La vitesse de création de blocs baisse

source: Average mining time goes back to normal
fr_fr: Le temps de minage moyen revient à la normale

source: The target value is recalculated every 2,016 blocks (aproximately two weeks)
fr_fr: La valeur cible est recalculée tous les 2016 blocs (environ deux semaines)

source: The ideal average mining time is stablished as 10 minutes per block.
fr_fr: Le temps de minage moyen est établit à 10 minutes par bloc.

source: Author: Patrícia Estevão
fr_fr: Auteure: Patrícia Estevão

source: Editor: Marco Agner
fr_fr: Editeur: Marco Agner

source: Translator: [Your name/handle or "Crowdsourced translation"]
fr_fr: Traducteur: Louis Dormegnie
